In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(
    {
        'col1': [1, 2, 3, 4],
        'col2': [444, 555, 666, 444],
        'col3': ['abc', 'def', 'ghi', 'xyz']
    }
)

In [8]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
df['col2'].unique()

array([444, 555, 666])

In [12]:
df['col2'].nunique()

3

In [13]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [15]:
# Col1 > 2
# Col2 == 444
newdf = df[df['col1'] > 2]

In [16]:
newdf

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [17]:
newdf = df[(df['col1'] > 2) & (df['col2'] == 444)]

In [18]:
newdf

   col1  col2 col3
3     4   444  xyz

In [20]:
def times_two(number):
    return number * 2

In [21]:
times_two(4)

8

In [22]:
df.apply(times_two)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [23]:
df['new'] = df['col1'].apply(times_two)

In [24]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [25]:
del df['new']

In [26]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
df['new'] = df['col1'].apply(times_two)

In [31]:
df.drop('new', axis=1)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [32]:
df.columns

Index(['col1', 'col2', 'col3', 'new'], dtype='object')

In [33]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
new     4 non-null int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [35]:
df.describe()

           col1        col2       new
count  4.000000    4.000000  4.000000
mean   2.500000  527.250000  5.000000
std    1.290994  106.274409  2.581989
min    1.000000  444.000000  2.000000
25%    1.750000  444.000000  3.500000
50%    2.500000  499.500000  5.000000
75%    3.250000  582.750000  6.500000
max    4.000000  666.000000  8.000000

In [36]:
df.sort_values(by='col2')

   col1  col2 col3  new
0     1   444  abc    2
3     4   444  xyz    8
1     2   555  def    4
2     3   666  ghi    6

In [38]:
df.sort_values(by='col2', ascending=False)

   col1  col2 col3  new
2     3   666  ghi    6
1     2   555  def    4
0     1   444  abc    2
3     4   444  xyz    8